In [1]:
import pandas as pd

## Series

In [2]:
## Creating empty series
d=pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_17168\779336895.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  d=pd.Series()

In [3]:
d

Series([], dtype: float64)

In [4]:
type(d)

pandas.core.series.Series

In [5]:
## Creating series with one element
d=pd.Series(17)

In [6]:
d

0    17
dtype: int64

In [7]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)

In [8]:
d

0    10
1    11
2    12
dtype: int64

In [9]:
##  creating series using list
d=pd.Series([45,78,56,445,78])

In [10]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [ ]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d=pd.Series(arr)

In [ ]:
d

In [22]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [25]:
d.values()

dict_values([1, 2, 3, 4])

In [13]:
d['a']

1

In [28]:
b=pd.Series(d)

In [29]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [19]:
import numpy as np

In [ ]:
s1=pd.Series(arr_2)
s1

In [20]:
arr_2=np.array([1,2,3])
s_2=pd.Series(arr_2 ,index=['one','two','three'])
s_2

one      1
two      2
three    3
dtype: int32

In [21]:
## checking the datatype
type(s_2)

pandas.core.series.Series

In [16]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [30]:
## access the data
b[3]

4

In [31]:
b['d']

4

In [ ]:
b['a']

In [ ]:
s_2['one']

In [32]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [33]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [34]:
d[[4,5,3,6]] ## multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [ ]:
d[4]=34  ## changing the element

In [ ]:
d[4]

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=['one','Two','Three','Four'])   
s[0:9]

## DataFrame

In [35]:
## empty dataframe
d=pd.DataFrame()

In [36]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [38]:
d

Empty DataFrame
Columns: []
Index: []

In [37]:
type(d)

pandas.core.frame.DataFrame

In [ ]:
import pandas as pd

In [39]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [40]:
data

[[1, 2, 3, 4], [14, 12, 1, 'a', 8], [7, 8, 9]]

In [41]:
np.array(data)

C:\Users\Dell\AppData\Local\Temp\ipykernel_17168\2544547496.py:1: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  np.array(data)

array([list([1, 2, 3, 4]), list([14, 12, 1, 'a', 8]), list([7, 8, 9])],
      dtype=object)

In [42]:
d=pd.DataFrame(data)
d

    0   1  2     3    4
0   1   2  3     4  NaN
1  14  12  1     a  8.0
2   7   8  9  None  NaN

In [ ]:
import pandas as pd

In [ ]:
d1=pd.DataFrame([[1, 2, 3, 4], [14, 12, 1, 'a', 'b'], [7, 8, 9]])
d1

In [ ]:
d

In [43]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','a']]

In [44]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['klm', 'a']]

In [45]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## chnaging the column

ValueError: 5 columns passed, passed data had 2 columns

In [46]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [47]:
d

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     a

In [48]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [49]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [55]:
data5={'Name':['Ashish','Astha','Ziya','Priya'],'Age':[21,19,20,18]}
type(data5)

dict

In [56]:
pd.DataFrame(data5)

     Name  Age
0  Ashish   21
1   Astha   19
2    Ziya   20
3   Priya   18

In [ ]:
## Task:- change the name of columns while defining the dataframe

In [52]:
d.rename({'name':'Name','age':'Age'},axis=1,inplace=True)

In [53]:
d

  Name  Age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [ ]:
d

In [3]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [ ]:
data

In [1]:
import pandas as pd

In [4]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [5]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
## accessing one single column
d['Name']

In [ ]:
d[['Name','Subject']]

In [11]:
d[[1]]

KeyError: "None of [Int64Index([1], dtype='int64')] are in the [columns]"

In [13]:
d.iloc[0,0] ="ALEX"

In [14]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [15]:
d['Gender'] = "Male"
d

    Name  Age  Subject Gender
0   ALEX   10    Maths   Male
1    Bob   12  Science   Male
2  Kelly   15      Eco   Male
3  Boris   14      Geo   Male
4    Ken   18  English   Male

In [6]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALex   10
1    Bob   12
2  Kelly   15
3  Boris   14
4    Ken   18

In [8]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   14
1    Bob   12

In [7]:
d.iloc[1:3,[0,1]]

    Name  Age
1    Bob   12
2  Kelly   15

In [ ]:
d

In [ ]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

loc used for locating with column names

In [19]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

    Name  Subject
0   ALEX    Maths
1    Bob  Science
2  Kelly      Eco

In [ ]:
d.iloc[0,0]='ALEX'
d

In [ ]:
d.iloc[:,1]=d.iloc[:,1] - 2

In [ ]:
d

In [ ]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']

In [ ]:
d

In [ ]:
d.loc[:,1]

In [ ]:
# loc is typically used for accessing columns.

In [ ]:
d['Age']

In [ ]:
d.loc[:,'Age']

In [ ]:
d.loc[3] ## getting the rows with singular index value

In [ ]:
d.iloc[:,[1,2]]

In [ ]:
d.iloc[:,1:3]

In [ ]:
pwd